name: "CnnMixture" 

layers { 
 name: "data" 
 type: DATA 
 top:  "data" 
 top:  "label" 
 data_param { 
   source: "/home/ge9/WACV2016/dataset/train/birdsnap/lmdb/birdsnap_train_lmdb" 
   backend: LMDB 
   batch_size: 15 
 } 
 transform_param { 
    crop_size: 226 
    mean_file: "/home/ge9/WACV2016/dataset/models/ImageNet/imagenet_mean.binaryproto" 
    mirror: true 
  } 
  include: { phase: TRAIN } 
} 

layers { 
 name: "data" 
 type: DATA 
 top:  "data" 
 top:  "label" 
 data_param { 
   source: "/home/ge9/WACV2016/dataset/test/birdsnap/lmdb/birdsnap_test_lmdb" 
   backend: LMDB 
   batch_size: 15 
 } 
 transform_param { 
    crop_size: 226 
    mean_file: "/home/ge9/WACV2016/dataset/models/ImageNet/imagenet_mean.binaryproto" 
    mirror: false 
  } 
  include: { phase: TEST } 
} 

layers {

  bottom: "data"

  top: "conv1/7x7_s2-se1"

  name: "conv1/7x7_s2-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    pad: 3

    kernel_size: 7

    stride: 2

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "conv1/7x7_s2-se1"

  top: "conv1/7x7_s2-se1"

  name: "conv1/relu_7x7-se1"

  type: RELU

}

layers {

  bottom: "conv1/7x7_s2-se1"

  top: "pool1/3x3_s2-se1"

  name: "pool1/3x3_s2-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 2

  }

}

layers {

  bottom: "pool1/3x3_s2-se1"

  top: "pool1/norm1-se1"

  name: "pool1/norm1-se1"

  type: LRN

  lrn_param {

    local_size: 5

    alpha: 0.0001

    beta: 0.75

  }

}

layers {

  bottom: "pool1/norm1-se1"

  top: "conv2/3x3_reduce-se1"

  name: "conv2/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "conv2/3x3_reduce-se1"

  top: "conv2/3x3_reduce-se1"

  name: "conv2/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "conv2/3x3_reduce-se1"

  top: "conv2/3x3-se1"

  name: "conv2/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 192

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "conv2/3x3-se1"

  top: "conv2/3x3-se1"

  name: "conv2/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "conv2/3x3-se1"

  top: "conv2/norm2-se1"

  name: "conv2/norm2-se1"

  type: LRN

  lrn_param {

    local_size: 5

    alpha: 0.0001

    beta: 0.75

  }

}

layers {

  bottom: "conv2/norm2-se1"

  top: "pool2/3x3_s2-se1"

  name: "pool2/3x3_s2-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 2

  }

}

layers {

  bottom: "pool2/3x3_s2-se1"

  top: "inception_3a/1x1-se1"

  name: "inception_3a/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/1x1-se1"

  top: "inception_3a/1x1-se1"

  name: "inception_3a/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "pool2/3x3_s2-se1"

  top: "inception_3a/3x3_reduce-se1"

  name: "inception_3a/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 96

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/3x3_reduce-se1"

  top: "inception_3a/3x3_reduce-se1"

  name: "inception_3a/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_3a/3x3_reduce-se1"

  top: "inception_3a/3x3-se1"

  name: "inception_3a/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/3x3-se1"

  top: "inception_3a/3x3-se1"

  name: "inception_3a/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "pool2/3x3_s2-se1"

  top: "inception_3a/5x5_reduce-se1"

  name: "inception_3a/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 16

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/5x5_reduce-se1"

  top: "inception_3a/5x5_reduce-se1"

  name: "inception_3a/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_3a/5x5_reduce-se1"

  top: "inception_3a/5x5-se1"

  name: "inception_3a/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/5x5-se1"

  top: "inception_3a/5x5-se1"

  name: "inception_3a/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "pool2/3x3_s2-se1"

  top: "inception_3a/pool-se1"

  name: "inception_3a/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_3a/pool-se1"

  top: "inception_3a/pool_proj-se1"

  name: "inception_3a/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/pool_proj-se1"

  top: "inception_3a/pool_proj-se1"

  name: "inception_3a/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_3a/1x1-se1"

  bottom: "inception_3a/3x3-se1"

  bottom: "inception_3a/5x5-se1"

  bottom: "inception_3a/pool_proj-se1"

  top: "inception_3a/output-se1"

  name: "inception_3a/output-se1"

  type: CONCAT

}

layers {

  bottom: "inception_3a/output-se1"

  top: "inception_3b/1x1-se1"

  name: "inception_3b/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/1x1-se1"

  top: "inception_3b/1x1-se1"

  name: "inception_3b/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "inception_3a/output-se1"

  top: "inception_3b/3x3_reduce-se1"

  name: "inception_3b/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/3x3_reduce-se1"

  top: "inception_3b/3x3_reduce-se1"

  name: "inception_3b/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_3b/3x3_reduce-se1"

  top: "inception_3b/3x3-se1"

  name: "inception_3b/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 192

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/3x3-se1"

  top: "inception_3b/3x3-se1"

  name: "inception_3b/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "inception_3a/output-se1"

  top: "inception_3b/5x5_reduce-se1"

  name: "inception_3b/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/5x5_reduce-se1"

  top: "inception_3b/5x5_reduce-se1"

  name: "inception_3b/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_3b/5x5_reduce-se1"

  top: "inception_3b/5x5-se1"

  name: "inception_3b/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 96

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/5x5-se1"

  top: "inception_3b/5x5-se1"

  name: "inception_3b/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "inception_3a/output-se1"

  top: "inception_3b/pool-se1"

  name: "inception_3b/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_3b/pool-se1"

  top: "inception_3b/pool_proj-se1"

  name: "inception_3b/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/pool_proj-se1"

  top: "inception_3b/pool_proj-se1"

  name: "inception_3b/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_3b/1x1-se1"

  bottom: "inception_3b/3x3-se1"

  bottom: "inception_3b/5x5-se1"

  bottom: "inception_3b/pool_proj-se1"

  top: "inception_3b/output-se1"

  name: "inception_3b/output-se1"

  type: CONCAT

}

layers {

  bottom: "inception_3b/output-se1"

  top: "pool3/3x3_s2-se1"

  name: "pool3/3x3_s2-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 2

  }

}

layers {

  bottom: "pool3/3x3_s2-se1"

  top: "inception_4a/1x1-se1"

  name: "inception_4a/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 192

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4a/1x1-se1"

  top: "inception_4a/1x1-se1"

  name: "inception_4a/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "pool3/3x3_s2-se1"

  top: "inception_4a/3x3_reduce-se1"

  name: "inception_4a/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 96

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4a/3x3_reduce-se1"

  top: "inception_4a/3x3_reduce-se1"

  name: "inception_4a/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4a/3x3_reduce-se1"

  top: "inception_4a/3x3-se1"

  name: "inception_4a/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 208

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4a/3x3-se1"

  top: "inception_4a/3x3-se1"

  name: "inception_4a/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "pool3/3x3_s2-se1"

  top: "inception_4a/5x5_reduce-se1"

  name: "inception_4a/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 16

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4a/5x5_reduce-se1"

  top: "inception_4a/5x5_reduce-se1"

  name: "inception_4a/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4a/5x5_reduce-se1"

  top: "inception_4a/5x5-se1"

  name: "inception_4a/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 48

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4a/5x5-se1"

  top: "inception_4a/5x5-se1"

  name: "inception_4a/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "pool3/3x3_s2-se1"

  top: "inception_4a/pool-se1"

  name: "inception_4a/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_4a/pool-se1"

  top: "inception_4a/pool_proj-se1"

  name: "inception_4a/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4a/pool_proj-se1"

  top: "inception_4a/pool_proj-se1"

  name: "inception_4a/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_4a/1x1-se1"

  bottom: "inception_4a/3x3-se1"

  bottom: "inception_4a/5x5-se1"

  bottom: "inception_4a/pool_proj-se1"

  top: "inception_4a/output-se1"

  name: "inception_4a/output-se1"

  type: CONCAT

}

layers {

  bottom: "inception_4a/output-se1"

  top: "loss1/ave_pool-se1"

  name: "loss1/ave_pool-se1"

  type: POOLING

  pooling_param {

    pool: AVE

    kernel_size: 5

    stride: 3

  }

}

layers {

  bottom: "loss1/ave_pool-se1"

  top: "loss1/conv-se1"

  name: "loss1/conv-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.08

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "loss1/conv-se1"

  top: "loss1/conv-se1"

  name: "loss1/relu_conv-se1"

  type: RELU

}

layers {

  bottom: "loss1/conv-se1"

  top: "loss1/fc-se1"

  name: "loss1/fc-se1"

  type: INNER_PRODUCT

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  inner_product_param {

    num_output: 1024

    weight_filler {

      type: "xavier"

      std: 0.02

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "loss1/fc-se1"

  top: "loss1/fc-se1"

  name: "loss1/relu_fc-se1"

  type: RELU

}

layers {

  bottom: "loss1/fc-se1"

  top: "loss1/fc-se1"

  name: "loss1/drop_fc-se1"

  type: DROPOUT

  dropout_param {

    dropout_ratio: 0.7

  }

}

layers {

  bottom: "loss1/fc-se1"

  top: "fc-1-se1"

  name: "loss1/classifier-se1"

  type: INNER_PRODUCT

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  inner_product_param {

    num_output: 500

    weight_filler {

      type: "xavier"

      std: 0.0009765625

    }

    bias_filler { 

      type: "constant"

      value: 0

    }

  }

}

layers {

  name: "prob_layer-se1"

  type: BNLL    

  bottom: "fc-1-se1"

  top: "fc-1-se1"

}

layers {

  bottom: "inception_4a/output-se1"

  top: "inception_4b/1x1-se1"

  name: "inception_4b/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 160

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4b/1x1-se1"

  top: "inception_4b/1x1-se1"

  name: "inception_4b/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "inception_4a/output-se1"

  top: "inception_4b/3x3_reduce-se1"

  name: "inception_4b/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 112

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4b/3x3_reduce-se1"

  top: "inception_4b/3x3_reduce-se1"

  name: "inception_4b/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4b/3x3_reduce-se1"

  top: "inception_4b/3x3-se1"

  name: "inception_4b/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 224

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4b/3x3-se1"

  top: "inception_4b/3x3-se1"

  name: "inception_4b/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "inception_4a/output-se1"

  top: "inception_4b/5x5_reduce-se1"

  name: "inception_4b/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 24

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4b/5x5_reduce-se1"

  top: "inception_4b/5x5_reduce-se1"

  name: "inception_4b/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4b/5x5_reduce-se1"

  top: "inception_4b/5x5-se1"

  name: "inception_4b/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4b/5x5-se1"

  top: "inception_4b/5x5-se1"

  name: "inception_4b/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "inception_4a/output-se1"

  top: "inception_4b/pool-se1"

  name: "inception_4b/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_4b/pool-se1"

  top: "inception_4b/pool_proj-se1"

  name: "inception_4b/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4b/pool_proj-se1"

  top: "inception_4b/pool_proj-se1"

  name: "inception_4b/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_4b/1x1-se1"

  bottom: "inception_4b/3x3-se1"

  bottom: "inception_4b/5x5-se1"

  bottom: "inception_4b/pool_proj-se1"

  top: "inception_4b/output-se1"

  name: "inception_4b/output-se1"

  type: CONCAT

}

layers {

  bottom: "inception_4b/output-se1"

  top: "inception_4c/1x1-se1"

  name: "inception_4c/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4c/1x1-se1"

  top: "inception_4c/1x1-se1"

  name: "inception_4c/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "inception_4b/output-se1"

  top: "inception_4c/3x3_reduce-se1"

  name: "inception_4c/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4c/3x3_reduce-se1"

  top: "inception_4c/3x3_reduce-se1"

  name: "inception_4c/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4c/3x3_reduce-se1"

  top: "inception_4c/3x3-se1"

  name: "inception_4c/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 256

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4c/3x3-se1"

  top: "inception_4c/3x3-se1"

  name: "inception_4c/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "inception_4b/output-se1"

  top: "inception_4c/5x5_reduce-se1"

  name: "inception_4c/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 24

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4c/5x5_reduce-se1"

  top: "inception_4c/5x5_reduce-se1"

  name: "inception_4c/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4c/5x5_reduce-se1"

  top: "inception_4c/5x5-se1"

  name: "inception_4c/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4c/5x5-se1"

  top: "inception_4c/5x5-se1"

  name: "inception_4c/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "inception_4b/output-se1"

  top: "inception_4c/pool-se1"

  name: "inception_4c/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_4c/pool-se1"

  top: "inception_4c/pool_proj-se1"

  name: "inception_4c/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4c/pool_proj-se1"

  top: "inception_4c/pool_proj-se1"

  name: "inception_4c/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_4c/1x1-se1"

  bottom: "inception_4c/3x3-se1"

  bottom: "inception_4c/5x5-se1"

  bottom: "inception_4c/pool_proj-se1"

  top: "inception_4c/output-se1"

  name: "inception_4c/output-se1"

  type: CONCAT

}

layers {

  bottom: "inception_4c/output-se1"

  top: "inception_4d/1x1-se1"

  name: "inception_4d/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 112

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4d/1x1-se1"

  top: "inception_4d/1x1-se1"

  name: "inception_4d/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "inception_4c/output-se1"

  top: "inception_4d/3x3_reduce-se1"

  name: "inception_4d/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 144

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4d/3x3_reduce-se1"

  top: "inception_4d/3x3_reduce-se1"

  name: "inception_4d/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4d/3x3_reduce-se1"

  top: "inception_4d/3x3-se1"

  name: "inception_4d/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 288

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4d/3x3-se1"

  top: "inception_4d/3x3-se1"

  name: "inception_4d/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "inception_4c/output-se1"

  top: "inception_4d/5x5_reduce-se1"

  name: "inception_4d/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4d/5x5_reduce-se1"

  top: "inception_4d/5x5_reduce-se1"

  name: "inception_4d/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4d/5x5_reduce-se1"

  top: "inception_4d/5x5-se1"

  name: "inception_4d/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4d/5x5-se1"

  top: "inception_4d/5x5-se1"

  name: "inception_4d/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "inception_4c/output-se1"

  top: "inception_4d/pool-se1"

  name: "inception_4d/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_4d/pool-se1"

  top: "inception_4d/pool_proj-se1"

  name: "inception_4d/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4d/pool_proj-se1"

  top: "inception_4d/pool_proj-se1"

  name: "inception_4d/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_4d/1x1-se1"

  bottom: "inception_4d/3x3-se1"

  bottom: "inception_4d/5x5-se1"

  bottom: "inception_4d/pool_proj-se1"

  top: "inception_4d/output-se1"

  name: "inception_4d/output-se1"

  type: CONCAT

}



layers {

  bottom: "inception_4d/output-se1"

  top: "loss2/ave_pool-se1"

  name: "loss2/ave_pool-se1"

  type: POOLING

  pooling_param {

    pool: AVE

    kernel_size: 5

    stride: 3

  }

}

layers {

  bottom: "loss2/ave_pool-se1"

  top: "loss2/conv-se1"

  name: "loss2/conv-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.08

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "loss2/conv-se1"

  top: "loss2/conv-se1"

  name: "loss2/relu_conv-se1"

  type: RELU

}

layers {

  bottom: "loss2/conv-se1"

  top: "loss2/fc-se1"

  name: "loss2/fc-se1"

  type: INNER_PRODUCT

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  inner_product_param {

    num_output: 1024

    weight_filler {

      type: "xavier"

      std: 0.02

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "loss2/fc-se1"

  top: "loss2/fc-se1"

  name: "loss2/relu_fc-se1"

  type: RELU

}

layers {

  bottom: "loss2/fc-se1"

  top: "loss2/fc-se1"

  name: "loss2/drop_fc-se1"

  type: DROPOUT

  dropout_param {

    dropout_ratio: 0.7

  }

}

layers {

  bottom: "loss2/fc-se1"

  top: "fc-2-se1"

  name: "loss2/classifier-se1"

  type: INNER_PRODUCT

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  inner_product_param {

    num_output: 500

    weight_filler {

      type: "xavier"

      std: 0.0009765625

    }

    bias_filler {

      type: "constant"

      value: 0

    }

  }

}

layers {

  name: "prob_layer-se1"

  type: BNLL    

  bottom: "fc-2-se1"

  top: "fc-2-se1"

}

layers {

  bottom: "inception_4d/output-se1"

  top: "inception_4e/1x1-se1"

  name: "inception_4e/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 256

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4e/1x1-se1"

  top: "inception_4e/1x1-se1"

  name: "inception_4e/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "inception_4d/output-se1"

  top: "inception_4e/3x3_reduce-se1"

  name: "inception_4e/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 160

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4e/3x3_reduce-se1"

  top: "inception_4e/3x3_reduce-se1"

  name: "inception_4e/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4e/3x3_reduce-se1"

  top: "inception_4e/3x3-se1"

  name: "inception_4e/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 320

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4e/3x3-se1"

  top: "inception_4e/3x3-se1"

  name: "inception_4e/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "inception_4d/output-se1"

  top: "inception_4e/5x5_reduce-se1"

  name: "inception_4e/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4e/5x5_reduce-se1"

  top: "inception_4e/5x5_reduce-se1"

  name: "inception_4e/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_4e/5x5_reduce-se1"

  top: "inception_4e/5x5-se1"

  name: "inception_4e/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4e/5x5-se1"

  top: "inception_4e/5x5-se1"

  name: "inception_4e/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "inception_4d/output-se1"

  top: "inception_4e/pool-se1"

  name: "inception_4e/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_4e/pool-se1"

  top: "inception_4e/pool_proj-se1"

  name: "inception_4e/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_4e/pool_proj-se1"

  top: "inception_4e/pool_proj-se1"

  name: "inception_4e/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_4e/1x1-se1"

  bottom: "inception_4e/3x3-se1"

  bottom: "inception_4e/5x5-se1"

  bottom: "inception_4e/pool_proj-se1"

  top: "inception_4e/output-se1"

  name: "inception_4e/output-se1"

  type: CONCAT

}

layers {

  bottom: "inception_4e/output-se1"

  top: "pool4/3x3_s2-se1"

  name: "pool4/3x3_s2-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 2

  }

}

layers {

  bottom: "pool4/3x3_s2-se1"

  top: "inception_5a/1x1-se1"

  name: "inception_5a/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 256

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5a/1x1-se1"

  top: "inception_5a/1x1-se1"

  name: "inception_5a/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "pool4/3x3_s2-se1"

  top: "inception_5a/3x3_reduce-se1"

  name: "inception_5a/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 160

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5a/3x3_reduce-se1"

  top: "inception_5a/3x3_reduce-se1"

  name: "inception_5a/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_5a/3x3_reduce-se1"

  top: "inception_5a/3x3-se1"

  name: "inception_5a/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 320

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5a/3x3-se1"

  top: "inception_5a/3x3-se1"

  name: "inception_5a/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "pool4/3x3_s2-se1"

  top: "inception_5a/5x5_reduce-se1"

  name: "inception_5a/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5a/5x5_reduce-se1"

  top: "inception_5a/5x5_reduce-se1"

  name: "inception_5a/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_5a/5x5_reduce-se1"

  top: "inception_5a/5x5-se1"

  name: "inception_5a/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5a/5x5-se1"

  top: "inception_5a/5x5-se1"

  name: "inception_5a/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "pool4/3x3_s2-se1"

  top: "inception_5a/pool-se1"

  name: "inception_5a/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_5a/pool-se1"

  top: "inception_5a/pool_proj-se1"

  name: "inception_5a/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5a/pool_proj-se1"

  top: "inception_5a/pool_proj-se1"

  name: "inception_5a/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_5a/1x1-se1"

  bottom: "inception_5a/3x3-se1"

  bottom: "inception_5a/5x5-se1"

  bottom: "inception_5a/pool_proj-se1"

  top: "inception_5a/output-se1"

  name: "inception_5a/output-se1"

  type: CONCAT

}

layers {

  bottom: "inception_5a/output-se1"

  top: "inception_5b/1x1-se1"

  name: "inception_5b/1x1-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 384

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5b/1x1-se1"

  top: "inception_5b/1x1-se1"

  name: "inception_5b/relu_1x1-se1"

  type: RELU

}

layers {

  bottom: "inception_5a/output-se1"

  top: "inception_5b/3x3_reduce-se1"

  name: "inception_5b/3x3_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 192

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5b/3x3_reduce-se1"

  top: "inception_5b/3x3_reduce-se1"

  name: "inception_5b/relu_3x3_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_5b/3x3_reduce-se1"

  top: "inception_5b/3x3-se1"

  name: "inception_5b/3x3-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 384

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5b/3x3-se1"

  top: "inception_5b/3x3-se1"

  name: "inception_5b/relu_3x3-se1"

  type: RELU

}

layers {

  bottom: "inception_5a/output-se1"

  top: "inception_5b/5x5_reduce-se1"

  name: "inception_5b/5x5_reduce-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 48

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5b/5x5_reduce-se1"

  top: "inception_5b/5x5_reduce-se1"

  name: "inception_5b/relu_5x5_reduce-se1"

  type: RELU

}

layers {

  bottom: "inception_5b/5x5_reduce-se1"

  top: "inception_5b/5x5-se1"

  name: "inception_5b/5x5-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5b/5x5-se1"

  top: "inception_5b/5x5-se1"

  name: "inception_5b/relu_5x5-se1"

  type: RELU

}

layers {

  bottom: "inception_5a/output-se1"

  top: "inception_5b/pool-se1"

  name: "inception_5b/pool-se1"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_5b/pool-se1"

  top: "inception_5b/pool_proj-se1"

  name: "inception_5b/pool_proj-se1"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_5b/pool_proj-se1"

  top: "inception_5b/pool_proj-se1"

  name: "inception_5b/relu_pool_proj-se1"

  type: RELU

}

layers {

  bottom: "inception_5b/1x1-se1"

  bottom: "inception_5b/3x3-se1"

  bottom: "inception_5b/5x5-se1"

  bottom: "inception_5b/pool_proj-se1"

  top: "inception_5b/output-se1"

  name: "inception_5b/output-se1"

  type: CONCAT

}

layers {

  bottom: "inception_5b/output-se1"

  top: "pool5/7x7_s1-se1"

  name: "pool5/7x7_s1-se1"

  type: POOLING

  pooling_param {

    pool: AVE

    kernel_size: 7

    stride: 1

  }

}

layers {

  bottom: "pool5/7x7_s1-se1"

  top: "pool5/7x7_s1-se1"

  name: "pool5/drop_7x7_s1-se1"

  type: DROPOUT

  dropout_param {

    dropout_ratio: 0.4

  }

}

layers {

  bottom: "pool5/7x7_s1-se1"

  top: "fc8-se1"

  name: "loss3/classifier-se1"

  type: INNER_PRODUCT

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  inner_product_param {

    num_output: 500

    weight_filler {

      type: "xavier"

    }

    bias_filler {

      type: "constant"

      value: 0

    }

  }

}

layers {

  name: "prob_layer-se1"

  type: BNLL    

  bottom: "fc8-se1"

  top: "fc8-se1"

}







 
layers {

  bottom: "data"

  top: "conv1/7x7_s2-se2"

  name: "conv1/7x7_s2-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    pad: 3

    kernel_size: 7

    stride: 2

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "conv1/7x7_s2-se2"

  top: "conv1/7x7_s2-se2"

  name: "conv1/relu_7x7-se2"

  type: RELU

}

layers {

  bottom: "conv1/7x7_s2-se2"

  top: "pool1/3x3_s2-se2"

  name: "pool1/3x3_s2-se2"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 2

  }

}

layers {

  bottom: "pool1/3x3_s2-se2"

  top: "pool1/norm1-se2"

  name: "pool1/norm1-se2"

  type: LRN

  lrn_param {

    local_size: 5

    alpha: 0.0001

    beta: 0.75

  }

}

layers {

  bottom: "pool1/norm1-se2"

  top: "conv2/3x3_reduce-se2"

  name: "conv2/3x3_reduce-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "conv2/3x3_reduce-se2"

  top: "conv2/3x3_reduce-se2"

  name: "conv2/relu_3x3_reduce-se2"

  type: RELU

}

layers {

  bottom: "conv2/3x3_reduce-se2"

  top: "conv2/3x3-se2"

  name: "conv2/3x3-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 192

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "conv2/3x3-se2"

  top: "conv2/3x3-se2"

  name: "conv2/relu_3x3-se2"

  type: RELU

}

layers {

  bottom: "conv2/3x3-se2"

  top: "conv2/norm2-se2"

  name: "conv2/norm2-se2"

  type: LRN

  lrn_param {

    local_size: 5

    alpha: 0.0001

    beta: 0.75

  }

}

layers {

  bottom: "conv2/norm2-se2"

  top: "pool2/3x3_s2-se2"

  name: "pool2/3x3_s2-se2"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 2

  }

}

layers {

  bottom: "pool2/3x3_s2-se2"

  top: "inception_3a/1x1-se2"

  name: "inception_3a/1x1-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 64

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/1x1-se2"

  top: "inception_3a/1x1-se2"

  name: "inception_3a/relu_1x1-se2"

  type: RELU

}

layers {

  bottom: "pool2/3x3_s2-se2"

  top: "inception_3a/3x3_reduce-se2"

  name: "inception_3a/3x3_reduce-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 96

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/3x3_reduce-se2"

  top: "inception_3a/3x3_reduce-se2"

  name: "inception_3a/relu_3x3_reduce-se2"

  type: RELU

}

layers {

  bottom: "inception_3a/3x3_reduce-se2"

  top: "inception_3a/3x3-se2"

  name: "inception_3a/3x3-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/3x3-se2"

  top: "inception_3a/3x3-se2"

  name: "inception_3a/relu_3x3-se2"

  type: RELU

}

layers {

  bottom: "pool2/3x3_s2-se2"

  top: "inception_3a/5x5_reduce-se2"

  name: "inception_3a/5x5_reduce-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 16

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/5x5_reduce-se2"

  top: "inception_3a/5x5_reduce-se2"

  name: "inception_3a/relu_5x5_reduce-se2"

  type: RELU

}

layers {

  bottom: "inception_3a/5x5_reduce-se2"

  top: "inception_3a/5x5-se2"

  name: "inception_3a/5x5-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    pad: 2

    kernel_size: 5

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/5x5-se2"

  top: "inception_3a/5x5-se2"

  name: "inception_3a/relu_5x5-se2"

  type: RELU

}

layers {

  bottom: "pool2/3x3_s2-se2"

  top: "inception_3a/pool-se2"

  name: "inception_3a/pool-se2"

  type: POOLING

  pooling_param {

    pool: MAX

    kernel_size: 3

    stride: 1

    pad: 1

  }

}

layers {

  bottom: "inception_3a/pool-se2"

  top: "inception_3a/pool_proj-se2"

  name: "inception_3a/pool_proj-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.1

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3a/pool_proj-se2"

  top: "inception_3a/pool_proj-se2"

  name: "inception_3a/relu_pool_proj-se2"

  type: RELU

}

layers {

  bottom: "inception_3a/1x1-se2"

  bottom: "inception_3a/3x3-se2"

  bottom: "inception_3a/5x5-se2"

  bottom: "inception_3a/pool_proj-se2"

  top: "inception_3a/output-se2"

  name: "inception_3a/output-se2"

  type: CONCAT

}

layers {

  bottom: "inception_3a/output-se2"

  top: "inception_3b/1x1-se2"

  name: "inception_3b/1x1-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/1x1-se2"

  top: "inception_3b/1x1-se2"

  name: "inception_3b/relu_1x1-se2"

  type: RELU

}

layers {

  bottom: "inception_3a/output-se2"

  top: "inception_3b/3x3_reduce-se2"

  name: "inception_3b/3x3_reduce-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 128

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.09

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/3x3_reduce-se2"

  top: "inception_3b/3x3_reduce-se2"

  name: "inception_3b/relu_3x3_reduce-se2"

  type: RELU

}

layers {

  bottom: "inception_3b/3x3_reduce-se2"

  top: "inception_3b/3x3-se2"

  name: "inception_3b/3x3-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 192

    pad: 1

    kernel_size: 3

    weight_filler {

      type: "xavier"

      std: 0.03

    }

    bias_filler {

      type: "constant"

      value: 0.2

    }

  }

}

layers {

  bottom: "inception_3b/3x3-se2"

  top: "inception_3b/3x3-se2"

  name: "inception_3b/relu_3x3-se2"

  type: RELU

}

layers {

  bottom: "inception_3a/output-se2"

  top: "inception_3b/5x5_reduce-se2"

  name: "inception_3b/5x5_reduce-se2"

  type: CONVOLUTION

  blobs_lr: 1

  blobs_lr: 2

  weight_decay: 1

  weight_decay: 0

  convolution_param {

    num_output: 32

    kernel_size: 1

    weight_filler {

      type: "xavier"

      std: 0.2
